In [20]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)
#import modul

1.2.4
1.20.1

In [21]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
df
#dataframe diisi dengan random

   omset  operasional
0     13            2
1     10           16
2     13            7
3      6           19
4     18            8

In [22]:
df['omset']= df['omset'] * 100_000
df['operasional']= df['operasional'] * 10_000
df

     omset  operasional
0  1300000        20000
1  1000000       160000
2  1300000        70000
3   600000       190000
4  1800000        80000

In [23]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df
#frekuensi Daily

     tanggal    omset  operasional
0 2000-01-01  1300000        20000
1 2000-01-02  1000000       160000
2 2000-01-03  1300000        70000
3 2000-01-04   600000       190000
4 2000-01-05  1800000        80000

In [24]:
formatku = {'tanggal':'{:%d/%m/%y}',
           'operasional':'Rp {:.2f}',
           'omset':'Rp {:.2f}'}

laporan = df.style.format(formatku)
laporan
#3 keys berisi formating terhadap data

In [25]:
type(laporan)

pandas.io.formats.style.Styler

In [26]:
laporan.hide_index()

In [27]:
laporan.set_caption('Data Omset dan Operasional')

In [29]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='gray')
#nilai omset terkecil ditandai warna pink
#nilai omset terbesar ditandai hijau terang
#nilai operasional terkecil ditandai warna biru
#nilai operasional terbesar ditandai max warna abu abu